#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
module.producer.data.archive_file.lambda: Reading...
module.consumer.data.archive_file.lambda: Reading...
module.producer.data.archive_file.lambda: Read complete after 0s [id=f568cfef8ffede0fdc5e9eb5b573487e240fd0a4]
module.consumer.data.archive_file.lambda: Read complete after 0s [id=c79f23ed4c166eb62e728c86119b5614028a6ea8]
module.consumer.aws_iam_role.lambda: Refreshing state... [id=kafka-consumer-lambda-role]
module.producer.aws_apigatewayv2_api.this[0]: Refreshing state... [id=v37gfzo7x0]
module.ec2_kafka.data.aws_ami.amazon_linux_2023: Reading...
module.ec2_kafka.data.aws_vpc.default: Reading...
module.ec2_kafka.aws_iam_role.ec2_kafka: Refreshing state... [id=ba-playground-ec2-kafka-role]
module.producer.aws_iam_role.lambda: Refreshing state... [id=kafka-producer-lambda-role]
module.consumer.aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=kafka-consumer-lambda-role-20260301143050764600000003]
module.consumer.aws_lambda_function.this: Refreshing state... [id=kafka-consumer]
module.ec2_kafka.aws_iam_role_policy_attachment.ssm_managed_core: Refreshing state... [id=ba-playground-ec2-kafka-role-20260301143050694100000001]
module.ec2_kafka.aws_iam_instance_profile.ec2_kafka: Refreshing state... [id=ba-playground-ec2-kafka-profile]
module.producer.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.producer.aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=kafka-producer-lambda-role-20260301143050755500000002]
module.producer.aws_lambda_function.this: Refreshing state... [id=kafka-producer]
module.producer.aws_lambda_permission.api_gateway[0]: Refreshing state... [id=AllowAPIGatewayInvoke]
module.producer.aws_apigatewayv2_integration.this[0]: Refreshing state... [id=jkgtiod]
module.ec2_kafka.data.aws_ami.amazon_linux_2023: Read complete after 2s [id=ami-0623e5e277f07a67b]
module.ec2_kafka.data.aws_vpc.default: Read complete after 2s [id=vpc-0b3960ee5649b7b01]
module.ec2_kafka.data.aws_subnets.default: Reading...
module.ec2_kafka.aws_security_group.ec2_kafka: Refreshing state... [id=sg-0f91576207861c4aa]
module.producer.aws_apigatewayv2_route.root_get[0]: Refreshing state... [id=t11vuyt]
module.producer.aws_apigatewayv2_route.root_post[0]: Refreshing state... [id=m8ti963]
module.producer.aws_apigatewayv2_route.get[0]: Refreshing state... [id=2tppt6p]
module.producer.aws_apigatewayv2_route.post[0]: Refreshing state... [id=mfokixq]
module.ec2_kafka.data.aws_subnets.default: Read complete after 0s [id=eu-west-2]
module.ec2_kafka.data.aws_subnet.first: Reading...
module.ec2_kafka.data.aws_subnet.first: Read complete after 0s [id=subnet-072c894e2d3b102cb]
module.ec2_kafka.aws_instance.kafka: Refreshing state... [id=i-065f97810fe482a6f]
module.ec2_kafka.aws_eip.kafka: Refreshing state... [id=eipalloc-00122317a574df2b9]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ec2_kafka.aws_instance.kafka has been deleted
  - resource "aws_instance" "kafka" {
      - id                                   = "i-065f97810fe482a6f" -> null
        tags                                 = {
            "Name" = "ba-playground-ec2-kafka"
        }
        # (33 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.ec2_kafka.aws_eip.kafka will be updated in-place
  ~ resource "aws_eip" "kafka" {
        id                   = "eipalloc-00122317a574df2b9"
      + instance             = (known after apply)
        tags                 = {
            "Name" = "ba-playground-ec2-kafka-eip"
        }
        # (10 unchanged attributes hidden)
    }

  # module.ec2_kafka.aws_instance.kafka will be created
  + resource "aws_instance" "kafka" {
      + ami                                  = "ami-0623e5e277f07a67b"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "ba-playground-ec2-kafka-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-072c894e2d3b102cb"
      + tags                                 = {
          + "Name" = "ba-playground-ec2-kafka"
        }
      + tags_all                             = {
          + "Name" = "ba-playground-ec2-kafka"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "ce5acb7cccb8834ad73b1cc5904236f81a19c5f9"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0f91576207861c4aa",
        ]

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ kafka_instance_id       = "i-065f97810fe482a6f" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

*Triggered by: @richcto*
